import React, {FC} from 'react';

const DescriptionOfJs: FC = () => {
    return (
        <div>
            <h2>JavaScript</h2>
            <img
                src="https://assets.ithillel.ua/images/blog/cover/_transform_blogSplashSimple_desktop_2x/1089/javascript.jpg"
                alt="img js"/>
            <p>JavaScript (англ. /ˈdʒɑːvəskrɪpt/; аббр. JS) — мультипарадигменный язык программирования. Поддерживает
                объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации
                ECMAScript (стандарт ECMA-262[2]).

                JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений.
                Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности
                веб-страницам.

                Основные архитектурные черты: динамическая типизация, слабая типизация, автоматическое управление
                памятью, прототипное программирование, функции как объекты первого класса.

                На JavaScript оказали влияние многие языки, при разработке была цель сделать язык похожим на Java.
                Языком JavaScript не владеет какая-либо организация или компания, что отличает его от ряда языков
                программирования, используемых в веб-разработке.</p>
        </div>
    );
};

export default DescriptionOfJs;